Revit 2027 API
ParameterTypeId.StructuralDisplayInHiddenViews Property
 "Display in Hidden Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralDisplayInHiddenViews { get; }
Public Shared ReadOnly Property StructuralDisplayInHiddenViews As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralDisplayInHiddenViews {
	ForgeTypeId^ get ();
}
static member StructuralDisplayInHiddenViews : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace